---
kind: property
id: P:Autodesk.Revit.DB.Architecture.TopographySurface.IsAssociatedWithBuildingPad
source: html/b1271349-2f66-dd23-94b5-0f6e5d19d680.htm
---
# Autodesk.Revit.DB.Architecture.TopographySurface.IsAssociatedWithBuildingPad Property

Identifies if this element represents a topography surface associated with a building pad.

## Syntax (C#)
```csharp
public bool IsAssociatedWithBuildingPad { get; }
```